/**
 * @author Aleksey Kornetov (all-1313@yandex.ru)
 * project chapter_002
 * Created on 07.02.2018.
 */
package ru.job4j.coffemachine;

/*
Задание такое.
		Надо реализовать метод выдачи сдачи для автомата.
		int[] changes(int value, int price)
		value = купюра. 50 100 и тд.
		price = цена кофе
		в автомате монеты наминалом 1 2 5 10
		Пример. Мы засунули 50 рублей выбрали кофе за 35. Сдачу автомат должен дать 15 рублей
		Алгоритм должен вернуть наименьшее количество монет.
		Метод вернет массив {10, 5} = 15 рублей
		создать задачу залить в репозитори добавить ссылку*/
